In [96]:
import pandas as pd
import numpy as np

In [97]:
students = pd.read_csv("student_records_dirty.csv")

In [98]:
students.head()

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,Taylor,Chen,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,Olivia,Martinez,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,Priya,Garcia,52,bio,2024-02-10,95,1.9,19051.36
3,15191,Priya,Anderson,61,CS,2024-02-08,3,2.0,17242.61
4,15734,Noah,Wilson,36,Comp Sci,"February 08, 2024",-20,3.2,NaN

In [99]:
students.shape

(355, 9)

In [100]:
students.sample(5)

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
20,16396,Noah,Clark,74,PSYCH,2024-04-12,ninety,NaN,20522.66
327,11895,Evan,Johnson,46,PSYCH,"January 07, 2024",12,1.9,18889.72
102,18392,Noah,Anderson,83,Psychology,"May 01, 2024",NaN,2.0,14482.19
345,10537,Taylor,Martinez,82,Biology,2024-02-18,-20,3.8,20783.40
104,17215,Ben,Nguyen,49,computer science,"February 18, 2024",-20,2.0,NaN

In [101]:
students['course_grade'].value_counts()

course_grade
100         36
12          34
 ninety     32
95          27
0           27
-20         27
 85         25
52          25
64          25
88          24
3           22
76          19
Name: count, dtype: int64

In [102]:
students["first_name"].value_counts(dropna=False)

first_name
Liam       22
Jordan     21
Maria      20
Mia        20
Chloe      19
Luis       18
Sam        18
Noah       18
Olivia     17
Ravi       17
Jamie      17
Evan       16
Taylor     15
Zoe        15
Priya      14
Ben        14
Emma       12
Aisha      12
Alex       12
Ethan      10
EMMA        2
 Olivia     2
ZOE         2
Emma        2
luis        2
Sam         2
 Mia        2
 Priya      1
AISHA       1
Jamie       1
Ravi        1
 Chloe      1
Taylor      1
Ben         1
 Jordan     1
 Emma       1
Ethan       1
RAVI        1
 Taylor     1
jamie       1
Luis        1
Name: count, dtype: int64

In [103]:
#replaceing string with na value in numpy #students["course_grade"] = students["course_grade"].replace("\"N/A\"", np.nan)

In [104]:
students.isna(sum)

TypeError: DataFrame.isna() takes 1 positional argument but 2 were given

In [ ]:
students.duplicated().sum()

np.int64(5)

In [ ]:
students.drop_duplicates()

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,Taylor,Chen,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,Olivia,Martinez,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,Priya,Garcia,52,bio,2024-02-10,95,1.9,19051.36
3,15191,Priya,Anderson,61,CS,2024-02-08,3,2.0,17242.61
4,15734,Noah,Wilson,36,Comp Sci,"February 08, 2024",-20,3.2,NaN
...,...,...,...,...,...,...,...,...,...
345,10537,Taylor,Martinez,82,Biology,2024-02-18,-20,3.8,20783.40
346,15986,Sam,Davis,59,Computer Science,2024-03-19,64,2.0,18087.82
347,11841,Evan,Martinez,39,PSYCH,"March 28, 2024",95,2.7,20000.00
348,18716,Aisha,Brown,71,Psychology,"January 01, 2024",ninety,NaN,13621.58
349,16971,Ben,Martinez,32,Comp Sci,"April 30, 2024",3,3.8,14181.07

In [ ]:
students = students.drop_duplicates()

In [ ]:
students["first_name"] = students["first_name"].str.strip().str.upper()

C:\Users\danie\AppData\Local\Temp\ipykernel_8608\3158692515.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  students["first_name"] = students["first_name"].str.strip().str.upper()

In [ ]:
students["last_name"] = students["last_name"].str.strip().str.upper()

In [ ]:
students["major"].str.strip().str.capitalize()

0                   Bio
1      Computer science
2                   Bio
3                    Cs
4              Comp sci
             ...
345             Biology
346    Computer science
347               Psych
348          Psychology
349            Comp sci
Name: major, Length: 350, dtype: object

In [ ]:
students["major"] = students["major"].str.strip().str.capitalize()
students["major"] = students["major"].replace({
    "Comp sci" : "Computer Science",
    "Cs" : "Computer Science",
    "Computer science" : "Computer Science",
    "Bio" : "Biology",
    "Psych" : "Psychology"
    })

C:\Users\danie\AppData\Local\Temp\ipykernel_8608\2581508996.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  students["major"] = students["major"].str.strip().str.capitalize()
C:\Users\danie\AppData\Local\Temp\ipykernel_8608\2581508996.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  students["major"] = students["major"].replace({

In [ ]:
students["major"].value_counts()

major
Computer Science    118
Biology             117
Psychology          115
Name: count, dtype: int64

In [ ]:
students["course_grade"] = students["course_grade"].str.strip()
students.loc[students["course_grade"] == "ninety", "course_grade"] = 90

In [ ]:
students["course_grade"].value_counts()

course_grade
100    36
12     34
nan    33
0      27
95     26
-20    26
64     25
52     25
85     24
88     24
3      21
76     19
Name: count, dtype: int64

In [ ]:
students["age"].describe()

count    345.000000
mean      52.617391
std       20.951321
min       17.000000
25%       33.000000
50%       52.000000
75%       71.000000
max       89.000000
Name: age, dtype: float64

In [ ]:
students.loc[students["age"] < 5, "age"] = np.nan

In [ ]:
students.loc[students["age"] > 100, "age"] = np.nan

In [ ]:
#first = last name challenge
students["full_name"] = students["first_name"] + ' ' + students["last_name"]

In [ ]:
students["full_name"]

0              TAYLOR Chen
1          OLIVIA Martinez
2             PRIYA Garcia
3           PRIYA Anderson
4              NOAH Wilson
                ...
347          EVAN Martinez
348            AISHA Brown
349           BEN Martinez
ninety                 NaN
 ninety                NaN
Name: full_name, Length: 352, dtype: object

In [ ]:
students["age_group"] = pd.cut(students["age"],
     bins=[0, 25, 40, 65,],
     labels=["Young adults", "working adults", "Retired"]
     )

In [ ]:
students[["age", "age_group"]].value_counts(dropna=False)

age   age_group
74.0  NaN               12
32.0  working adults    11
33.0  working adults     9
85.0  NaN                9
79.0  NaN                8
                        ..
64.0  Retired            2
86.0  NaN                2
87.0  NaN                2
57.0  Retired            1
27.0  working adults     1
Name: count, Length: 74, dtype: int64

In [ ]:
students['cost_per_semester'] = students['tuition_paid'] / 3

In [ ]:
students['cost_per_semester'].describe()

count     330.000000
mean     6115.561606
std       880.208480
min      3571.940000
25%      5583.553333
50%      6159.406667
75%      6666.666667
max      8717.076667
Name: cost_per_semester, dtype: float64

In [ ]:
students["enrollment_date"] = pd.to_datetime(students["enrollment_date"])

ValueError: time data "January 30, 2024" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [ ]:
students["enrollment_date"].describe(datement_is_numeric=True)

TypeError: NDFrame.describe() got an unexpected keyword argument 'datement_is_numeric'